apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_efuse_table.c
/****************************************************************************
 * arch/xtensa/src/esp32s2/esp32s2_efuse_table.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdint.h>
#include <stddef.h>
#include <nuttx/efuse/efuse.h>
#include "esp32s2_efuse.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

static const efuse_desc_t WR_DIS[] =
{
  {
    0, 32  /* Write protection */
  },
};

static const efuse_desc_t WR_DIS_RD_DIS[] =
{
  {
    0, 1  /* Write protection for RD_DIS.KEY0 RD_DIS.KEY1 RD_DIS.KEY2 RD_DIS.KEY3 RD_DIS.KEY4 RD_DIS.KEY5 RD_DIS.SYS_DATA_PART2, */
  },
};

static const efuse_desc_t WR_DIS_GROUP_1[] =
{
  {
    2, 1  /* Write protection for DIS_ICACHE DIS_DCACHE DIS_DOWNLOAD_ICACHE DIS_DOWNLOAD_DCACHE DIS_FORCE_DOWNLOAD DIS_USB DIS_CAN DIS_BOOT_REMAP SOFT_DIS_JTAG HARD_DIS.JTAG DIS_DOWNLOAD_MANUAL_ENCRYPT, */
  },
};

static const efuse_desc_t WR_DIS_GROUP_2[] =
{
  {
    3, 1  /* Write protection for VDD_SPI_XPD VDD_SPI_TIEH VDD_SPI_FORCE VDD_SPI_INIT VDD_SPI_DCAP WDT_DELAY_SEL, */
  },
};

static const efuse_desc_t WR_DIS_SPI_BOOT_CRYPT_CNT[] =
{
  {
    4, 1  /* Write protection for SPI_BOOT_CRYPT_CNT, */
  },
};

static const efuse_desc_t WR_DIS_SECURE_BOOT_KEY_REVOKE0[] =
{
  {
    5, 1  /* Write protection for SECURE_BOOT_KEY_REVOKE0, */
  },
};

static const efuse_desc_t WR_DIS_SECURE_BOOT_KEY_REVOKE1[] =
{
  {
    6, 1  /* Write protection for SECURE_BOOT_KEY_REVOKE1, */
  },
};

static const efuse_desc_t WR_DIS_SECURE_BOOT_KEY_REVOKE2[] =
{
  {
    7, 1  /* Write protection for SECURE_BOOT_KEY_REVOKE2, */
  },
};

static const efuse_desc_t WR_DIS_KEY0_PURPOSE[] =
{
  {
    8, 1  /* Write protection for key_purpose. KEY0, */
  },
};

static const efuse_desc_t WR_DIS_KEY1_PURPOSE[] =
{
  {
    9, 1  /* Write protection for key_purpose. KEY1, */
  },
};

static const efuse_desc_t WR_DIS_KEY2_PURPOSE[] =
{
  {
    10, 1  /* Write protection for key_purpose. KEY2, */
  },
};

static const efuse_desc_t WR_DIS_KEY3_PURPOSE[] =
{
  {
    11, 1  /* Write protection for key_purpose. KEY3, */
  },
};

static const efuse_desc_t WR_DIS_KEY4_PURPOSE[] =
{
  {
    12, 1  /* Write protection for key_purpose. KEY4, */
  },
};

static const efuse_desc_t WR_DIS_KEY5_PURPOSE[] =
{
  {
    13, 1  /* Write protection for key_purpose. KEY5, */
  },
};

static const efuse_desc_t WR_DIS_SECURE_BOOT_EN[] =
{
  {
    15, 1  /* Write protection for SECURE_BOOT_EN, */
  },
};

static const efuse_desc_t WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  {
    16, 1  /* Write protection for SECURE_BOOT_AGGRESSIVE_REVOKE, */
  },
};

static const efuse_desc_t WR_DIS_GROUP_3[] =
{
  {
    18, 1  /* Write protection for FLASH_TPUW DIS_DOWNLOAD_MODE DIS_LEGACY_SPI_BOOT UART_PRINT_CHANNEL DIS_USB_DOWNLOAD_MODE ENABLE_SECURITY_DOWNLOAD UART_PRINT_CONTROL PIN_POWER_SELECTION FLASH_TYPE FORCE_SEND_RESUME SECURE_VERSION, */
  },
};

static const efuse_desc_t WR_DIS_BLK1[] =
{
  {
    20, 1  /* Write protection for EFUSE_BLK1.  MAC_SPI_8M_SYS, */
  },
};

static const efuse_desc_t WR_DIS_SYS_DATA_PART1[] =
{
  {
    21, 1  /* Write protection for EFUSE_BLK2.  SYS_DATA_PART1, */
  },
};

static const efuse_desc_t WR_DIS_USER_DATA[] =
{
  {
    22, 1  /* Write protection for EFUSE_BLK3.  USER_DATA, */
  },
};

static const efuse_desc_t WR_DIS_KEY0[] =
{
  {
    23, 1  /* Write protection for EFUSE_BLK4.  KEY0, */
  },
};

static const efuse_desc_t WR_DIS_KEY1[] =
{
  {
    24, 1  /* Write protection for EFUSE_BLK5.  KEY1, */
  },
};

static const efuse_desc_t WR_DIS_KEY2[] =
{
  {
    25, 1  /* Write protection for EFUSE_BLK6.  KEY2, */
  },
};

static const efuse_desc_t WR_DIS_KEY3[] =
{
  {
    26, 1  /* Write protection for EFUSE_BLK7.  KEY3, */
  },
};

static const efuse_desc_t WR_DIS_KEY4[] =
{
  {
    27, 1  /* Write protection for EFUSE_BLK8.  KEY4, */
  },
};

static const efuse_desc_t WR_DIS_KEY5[] =
{
  {
    28, 1  /* Write protection for EFUSE_BLK9.  KEY5, */
  },
};

static const efuse_desc_t WR_DIS_SYS_DATA_PART2[] =
{
  {
    29, 1  /* Write protection for EFUSE_BLK10. SYS_DATA_PART2, */
  },
};

static const efuse_desc_t WR_DIS_USB_EXCHG_PINS[] =
{
  {
    30, 1  /* Write protection for USB_EXCHG_PINS, */
  },
};

static const efuse_desc_t RD_DIS[] =
{
  {
    32, 7  /* Read protection */
  },
};

static const efuse_desc_t RDWR_DIS_SYS_DATA_PART2_DIS_KEY0[] =
{
  {
    32, 1  /* Read protection for EFUSE_BLK4.  KEY0, */
  },
};

static const efuse_desc_t RD_DIS_KEY1[] =
{
  {
    33, 1  /* Read protection for EFUSE_BLK5.  KEY1, */
  },
};

static const efuse_desc_t RD_DIS_KEY2[] =
{
  {
    34, 1  /* Read protection for EFUSE_BLK6.  KEY2, */
  },
};

static const efuse_desc_t RD_DIS_KEY3[] =
{
  {
    35, 1  /* Read protection for EFUSE_BLK7.  KEY3, */
  },
};

static const efuse_desc_t RD_DIS_KEY4[] =
{
  {
    36, 1  /* Read protection for EFUSE_BLK8.  KEY4, */
  },
};

static const efuse_desc_t RD_DIS_KEY5[] =
{
  {
    37, 1  /* Read protection for EFUSE_BLK9.  KEY5, */
  },
};

static const efuse_desc_t RD_DIS_SYS_DATA_PART2[] =
{
  {
    38, 1  /* Read protection for EFUSE_BLK10. SYS_DATA_PART2, */
  },
};

static const efuse_desc_t DIS_RTC_RAM_BOOT[] =
{
  {
    39, 1  /* Disable boot from RTC RAM, */
  },
};

