apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_efuse_table.c
static const efuse_desc_t DIS_ICACHE[] =
{
  {
    40, 1  /* Disable Icache, */
  },
};

static const efuse_desc_t DIS_DCACHE[] =
{
  {
    41, 1  /* Disable DCACHE, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_ICACHE[] =
{
  {
    42, 1  /* Disable Icache in download mode, include boot_mode 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_DCACHE[] =
{
  {
    43, 1  /* Disable Dcache in download mode include boot_mode 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_FORCE_DOWNLOAD[] =
{
  {
    44, 1  /* Disable force chip go to download mode function, */
  },
};

static const efuse_desc_t DIS_USB[] =
{
  {
    45, 1  /* Disable USB function, */
  },
};

static const efuse_desc_t DIS_CAN[] =
{
  {
    46, 1  /* Disable CAN function, */
  },
};

static const efuse_desc_t DIS_BOOT_REMAP[] =
{
  {
    47, 1  /* Disable boot from RAM. REMAP means RAM space can be mapped to ROM space. this signal will disable this function, */
  },
};

static const efuse_desc_t SOFT_DIS_JTAG[] =
{
  {
    49, 1  /* Software disable jtag jtag can be activated again by hmac module, */
  },
};

static const efuse_desc_t HARD_DIS_JTAG[] =
{
  {
    50, 1  /* Hardware disable jtag permanently disable jtag function, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_MANUAL_ENCRYPT[] =
{
  {
    51, 1  /* Disable flash encrypt function, */
  },
};

static const efuse_desc_t USB_EXCHG_PINS[] =
{
  {
    56, 1  /* Exchange D+ D- pins, */
  },
};

static const efuse_desc_t USB_EXT_PHY_ENABLE[] =
{
  {
    57, 1  /* Enable external PHY, */
  },
};

static const efuse_desc_t BLOCK0_VERSION[] =
{
  {
    59, 2  /* BLOCK0 efuse version, */
  },
};

static const efuse_desc_t VDD_SPI_XPD[] =
{
  {
    68, 1  /* VDD_SPI regulator power up, */
  },
};

static const efuse_desc_t VDD_SPI_TIEH[] =
{
  {
    69, 1  /* VDD_SPI regulator tie high to vdda, */
  },
};

static const efuse_desc_t VDD_SPI_FORCE[] =
{
  {
    70, 1  /* Force using eFuse configuration of VDD_SPI, */
  },
};

static const efuse_desc_t WDT_DELAY_SEL[] =
{
  {
    80, 2  /* Select RTC WDT time out threshold, */
  },
};

static const efuse_desc_t SPI_BOOT_CRYPT_CNT[] =
{
  {
    82, 3  /* SPI boot encrypt decrypt enable. odd number 1 enable. even number 1 disable, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE0[] =
{
  {
    85, 1  /* Enable revoke first secure boot key, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE1[] =
{
  {
    86, 1  /* Enable revoke second secure boot key, */
  },
};

static const efuse_desc_t SECURE_BOOT_KEY_REVOKE2[] =
{
  {
    87, 1  /* Enable revoke third secure boot key, */
  },
};

static const efuse_desc_t KEY_PURPOSE_0[] =
{
  {
    88, 4  /* Key0 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_1[] =
{
  {
    92, 4  /* Key1 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_2[] =
{
  {
    96, 4  /* Key2 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_3[] =
{
  {
    100, 4  /* Key3 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_4[] =
{
  {
    104, 4  /* Key4 purpose, */
  },
};

static const efuse_desc_t KEY_PURPOSE_5[] =
{
  {
    108, 4  /* Key5 purpose, */
  },
};

static const efuse_desc_t SECURE_BOOT_EN[] =
{
  {
    116, 1  /* Secure boot enable, */
  },
};

static const efuse_desc_t SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  {
    117, 1  /* Enable aggressive secure boot revoke, */
  },
};

static const efuse_desc_t FLASH_TPUW[] =
{
  {
    124, 4  /* Flash wait time after power up. (unit is ms). When value is 15. the time is 30 ms, */
  },
};

static const efuse_desc_t DIS_DOWNLOAD_MODE[] =
{
  {
    128, 1  /* Disable download mode include boot_mode[3:0] is 0 1 2 3 6 7, */
  },
};

static const efuse_desc_t DIS_LEGACY_SPI_BOOT[] =
{
  {
    129, 1  /* Disable_Legcy_SPI_boot mode include boot_mode[3:0] is 4, */
  },
};

static const efuse_desc_t UART_PRINT_CHANNEL[] =
{
  {
    130, 1  /* 0: UART0. 1: UART1, */
  },
};

static const efuse_desc_t DIS_USB_DOWNLOAD_MODE[] =
{
  {
    132, 1  /* Disable download through USB, */
  },
};

static const efuse_desc_t ENABLE_SECURITY_DOWNLOAD[] =
{
  {
    133, 1  /* Enable security download mode, */
  },
};

static const efuse_desc_t UART_PRINT_CONTROL[] =
{
  {
    134, 2  /* b00:force print. b01:control by GPIO46 - low level print. b10:control by GPIO46 - high level print. b11:force disable print., */
  },
};

static const efuse_desc_t PIN_POWER_SELECTION[] =
{
  {
    136, 1  /* GPIO33-GPIO37 power supply selection in ROM code. 0:VDD3P3_CPU. 1:VDD_SPI., */
  },
};

static const efuse_desc_t FLASH_TYPE[] =
{
  {
    137, 1  /* Connected Flash interface type. 0: 4 data line. 1: 8 data line, */
  },
};

static const efuse_desc_t FORCE_SEND_RESUME[] =
{
  {
    138, 1  /* Force ROM code to send a resume command during SPI boot, */
  },
};

static const efuse_desc_t SECURE_VERSION[] =
{
  {
    139, 16  /* Secure version for anti-rollback, */
  },
};

static const efuse_desc_t MAC_FACTORY[] =
{
  {
    296, 8  /* Factory MAC addr [0], */
  },
  {
    288, 8  /* Factory MAC addr [1], */
  },
  {
    280, 8  /* Factory MAC addr [2], */
  },
  {
    272, 8  /* Factory MAC addr [3], */
  },
  {
    264, 8  /* Factory MAC addr [4], */
  },
  {
    256, 8  /* Factory MAC addr [5], */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_CLK[] =
{
  {
    304, 6  /* SPI_PAD_configure CLK, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_Q_D1[] =
{
  {
    310, 6  /* SPI_PAD_configure Q(D1), */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_D_D0[] =
{
  {
    316, 6  /* SPI_PAD_configure D(D0), */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_CS[] =
{
  {
    322, 6  /* SPI_PAD_configure CS, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_HD_D3[] =
{
  {
    328, 6  /* SPI_PAD_configure HD(D3), */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_WP_D2[] =
{
  {
    334, 6  /* SPI_PAD_configure WP(D2), */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_DQS[] =
{
  {
    340, 6  /* SPI_PAD_configure DQS, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_D4[] =
{
  {
    346, 6  /* SPI_PAD_configure D4, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_D5[] =
{
  {
    352, 6  /* SPI_PAD_configure D5, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_D6[] =
{
  {
    358, 6  /* SPI_PAD_configure D6, */
  },
};

static const efuse_desc_t SPI_PAD_CONFIG_D7[] =
{
  {
    364, 6  /* SPI_PAD_configure D7, */
  },
};

