apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_efuse_table.c
static const efuse_desc_t SYS_DATA_PART1[] =
{
  {
    512, 256  /* System configuration, */
  },
};

static const efuse_desc_t USER_DATA[] =
{
  {
    768, 256  /* User data, */
  },
};

static const efuse_desc_t KEY0[] =
{
  {
    1024, 256  /* Key0 or user data, */
  },
};

static const efuse_desc_t KEY1[] =
{
  {
    1280, 256  /* Key1 or user data, */
  },
};

static const efuse_desc_t KEY2[] =
{
  {
    1536, 256  /* Key2 or user data, */
  },
};

static const efuse_desc_t KEY3[] =
{
  {
    1792, 256  /* Key3 or user data, */
  },
};

static const efuse_desc_t KEY4[] =
{
  {
    2048, 256  /* Key4 or user data, */
  },
};

static const efuse_desc_t KEY5[] =
{
  {
    2304, 256  /* Key5 or user data, */
  },
};

static const efuse_desc_t SYS_DATA_PART2[] =
{
  {
    2560, 256  /* System configuration, */
  },
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_RD_DIS[] =
{
  &WR_DIS_RD_DIS[0],  /* Write protection for RD_DIS.KEY0 RD_DIS.KEY1 RD_DIS.KEY2 RD_DIS.KEY3 RD_DIS.KEY4 RD_DIS.KEY5 RD_DIS.SYS_DATA_PART2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_DIS_RTC_RAM_BOOT[] =
{
  &WR_DIS_DIS_RTC_RAM_BOOT[0],  /* Write protection for DIS_RTC_RAM_BOOT */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_GROUP_1[] =
{
  &WR_DIS_GROUP_1[0],  /* Write protection for DIS_ICACHE DIS_DCACHE DIS_DOWNLOAD_ICACHE DIS_DOWNLOAD_DCACHE DIS_FORCE_DOWNLOAD DIS_USB DIS_CAN DIS_BOOT_REMAP SOFT_DIS_JTAG HARD_DIS.JTAG DIS_DOWNLOAD_MANUAL_ENCRYPT */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_GROUP_2[] =
{
  &WR_DIS_GROUP_2[0],  /* Write protection for VDD_SPI_XPD VDD_SPI_TIEH VDD_SPI_FORCE VDD_SPI_INIT VDD_SPI_DCAP WDT_DELAY_SEL */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SPI_BOOT_CRYPT_CNT[] =
{
  &WR_DIS_SPI_BOOT_CRYPT_CNT[0],  /* Write protection for SPI_BOOT_CRYPT_CNT */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE0[] =
{
  &WR_DIS_SECURE_BOOT_KEY_REVOKE0[0],  /* Write protection for SECURE_BOOT_KEY_REVOKE0 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE1[] =
{
  &WR_DIS_SECURE_BOOT_KEY_REVOKE1[0],  /* Write protection for SECURE_BOOT_KEY_REVOKE1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SECURE_BOOT_KEY_REVOKE2[] =
{
  &WR_DIS_SECURE_BOOT_KEY_REVOKE2[0],  /* Write protection for SECURE_BOOT_KEY_REVOKE2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY0_PURPOSE[] =
{
  &WR_DIS_KEY0_PURPOSE[0],  /* Write protection for key_purpose. KEY0 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY1_PURPOSE[] =
{
  &WR_DIS_KEY1_PURPOSE[0],  /* Write protection for key_purpose. KEY1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY2_PURPOSE[] =
{
  &WR_DIS_KEY2_PURPOSE[0],  /* Write protection for key_purpose. KEY2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY3_PURPOSE[] =
{
  &WR_DIS_KEY3_PURPOSE[0],  /* Write protection for key_purpose. KEY3 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY4_PURPOSE[] =
{
  &WR_DIS_KEY4_PURPOSE[0],  /* Write protection for key_purpose. KEY4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY5_PURPOSE[] =
{
  &WR_DIS_KEY5_PURPOSE[0],  /* Write protection for key_purpose. KEY5 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SECURE_BOOT_EN[] =
{
  &WR_DIS_SECURE_BOOT_EN[0],  /* Write protection for SECURE_BOOT_EN */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  &WR_DIS_SECURE_BOOT_AGGRESSIVE_REVOKE[0],  /* Write protection for SECURE_BOOT_AGGRESSIVE_REVOKE */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_GROUP_3[] =
{
  &WR_DIS_GROUP_3[0],  /* Write protection for FLASH_TPUW DIS_DOWNLOAD_MODE DIS_LEGACY_SPI_BOOT UART_PRINT_CHANNEL DIS_TINY_BASIC DIS_USB_DOWNLOAD_MODE ENABLE_SECURITY_DOWNLOAD UART_PRINT_CONTROL PIN_POWER_SELECTION FLASH_TYPE FORCE_SEND_RESUME SECURE_VERSION */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_BLK1[] =
{
  &WR_DIS_BLK1[0],  /* Write protection for EFUSE_BLK1.  MAC_SPI_8M_SYS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SYS_DATA_PART1[] =
{
  &WR_DIS_SYS_DATA_PART1[0],  /* Write protection for EFUSE_BLK2.  SYS_DATA_PART1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_USER_DATA[] =
{
  &WR_DIS_USER_DATA[0],  /* Write protection for EFUSE_BLK3.  USER_DATA */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY0[] =
{
  &WR_DIS_KEY0[0],  /* Write protection for EFUSE_BLK4.  KEY0 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY1[] =
{
  &WR_DIS_KEY1[0],  /* Write protection for EFUSE_BLK5.  KEY1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY2[] =
{
  &WR_DIS_KEY2[0],  /* Write protection for EFUSE_BLK6.  KEY2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY3[] =
{
  &WR_DIS_KEY3[0],  /* Write protection for EFUSE_BLK7.  KEY3 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY4[] =
{
  &WR_DIS_KEY4[0],  /* Write protection for EFUSE_BLK8.  KEY4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_KEY5[] =
{
  &WR_DIS_KEY5[0],  /* Write protection for EFUSE_BLK9.  KEY5 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_SYS_DATA_PART2[] =
{
  &WR_DIS_SYS_DATA_PART2[0],  /* Write protection for EFUSE_BLK10. SYS_DATA_PART2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WR_DIS_USB_EXCHG_PINS[] =
{
  &WR_DIS_USB_EXCHG_PINS[0],  /* Write protection for USB_EXCHG_PINS */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS[] =
{
  &RD_DIS[0],  /* Read protection */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RDWR_DIS_SYS_DATA_PART2_DIS_KEY0[] =
{
  &RDWR_DIS_SYS_DATA_PART2_DIS_KEY0[0],  /* Read protection for EFUSE_BLK4.  KEY0 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY1[] =
{
  &RD_DIS_KEY1[0],  /* Read protection for EFUSE_BLK5.  KEY1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY2[] =
{
  &RD_DIS_KEY2[0],  /* Read protection for EFUSE_BLK6.  KEY2 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY3[] =
{
  &RD_DIS_KEY3[0],  /* Read protection for EFUSE_BLK7.  KEY3 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY4[] =
{
  &RD_DIS_KEY4[0],  /* Read protection for EFUSE_BLK8.  KEY4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_KEY5[] =
{
  &RD_DIS_KEY5[0],  /* Read protection for EFUSE_BLK9.  KEY5 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_RD_DIS_SYS_DATA_PART2[] =
{
  &RD_DIS_SYS_DATA_PART2[0],  /* Read protection for EFUSE_BLK10. SYS_DATA_PART2 */
  NULL
};

