apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_efuse_table.c
const efuse_desc_t *ESP_EFUSE_DIS_RTC_RAM_BOOT[] =
{
  &DIS_RTC_RAM_BOOT[0],  /* Disable boot from RTC RAM */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_ICACHE[] =
{
  &DIS_ICACHE[0],  /* Disable Icache */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DCACHE[] =
{
  &DIS_DCACHE[0],  /* Disable DCACHE */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_ICACHE[] =
{
  &DIS_DOWNLOAD_ICACHE[0],  /* Disable Icache in download mode */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_DCACHE[] =
{
  &DIS_DOWNLOAD_DCACHE[0],  /* Disable Dcache in download mode include boot_mode 0 1 2 3 6 7, */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_FORCE_DOWNLOAD[] =
{
  &DIS_FORCE_DOWNLOAD[0],  /* Disable force chip go to download mode function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_USB[] =
{
  &DIS_USB[0],  /* Disable USB function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_CAN[] =
{
  &DIS_CAN[0],  /* Disable CAN function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_BOOT_REMAP[] =
{
  &DIS_APP_CPU[0],  /* Disable boot from RAM. REMAP means RAM space can be mapped to ROM space. this signal will disable this function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SOFT_DIS_JTAG[] =
{
  &SOFT_DIS_JTAG[0],  /* Software disable jtag jtag can be activated again by hmac module */
  NULL
};

const efuse_desc_t *ESP_EFUSE_HARD_DIS_JTAG[] =
{
  &HARD_DIS_JTAG[0],  /* Hardware disable jtag permanently disable jtag function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT[] =
{
  &DIS_DOWNLOAD_MANUAL_ENCRYPT[0],  /* Disable flash encrypt function */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USB_EXCHG_PINS[] =
{
  &USB_EXCHG_PINS[0],  /* Exchange D+ D- pins */
  NULL
};

const efuse_desc_t *ESP_EFUSE_USB_EXT_PHY_ENABLE[] =
{
  &USB_EXT_PHY_ENABLE[0],  /* Enable external PHY */
  NULL
};

const efuse_desc_t *ESP_EFUSE_BLOCK0_VERSION[] =
{
  &BLOCK0_VERSION[0],  /* BLOCK0 efuse version */
  NULL
};

const efuse_desc_t *ESP_EFUSE_VDD_SPI_XPD[] =
{
  &VDD_SPI_XPD[0],  /* VDD_SPI regulator power up */
  NULL
};

const efuse_desc_t *ESP_EFUSE_VDD_SPI_TIEH[] =
{
  &VDD_SPI_TIEH[0],  /* VDD_SPI regulator tie high to vdda */
  NULL
};

const efuse_desc_t *ESP_EFUSE_VDD_SPI_FORCE[] =
{
  &VDD_SPI_FORCE[0],  /* Force using eFuse configuration of VDD_SPI */
  NULL
};

const efuse_desc_t *ESP_EFUSE_WDT_DELAY_SEL[] =
{
  &WDT_DELAY_SEL[0],  /* Select RTC WDT time out threshold */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_BOOT_CRYPT_CNT[] =
{
  &SPI_BOOT_CRYPT_CNT[0],  /* SPI boot encrypt decrypt enable. odd number 1 enable. even number 1 disable */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_KEY_REVOKE0[] =
{
  &SECURE_BOOT_KEY_REVOKE0[0],  /* Enable revoke first secure boot key */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_KEY_REVOKE1[] =
{
  &SECURE_BOOT_KEY_REVOKE1[0],  /* Enable revoke second secure boot key */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_KEY_REVOKE2[] =
{
  &SECURE_BOOT_KEY_REVOKE2[0],  /* Enable revoke third secure boot key */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_0[] =
{
  &KEY_PURPOSE_0[0],  /* Key0 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_1[] =
{
  &KEY_PURPOSE_1[0],  /* Key1 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_2[] =
{
  &KEY_PURPOSE_2[0],  /* Key2 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_3[] =
{
  &KEY_PURPOSE_3[0],  /* Key3 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_4[] =
{
  &KEY_PURPOSE_4[0],  /* Key4 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_KEY_PURPOSE_5[] =
{
  &KEY_PURPOSE_5[0],  /* Key5 purpose */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_EN[] =
{
  &SECURE_BOOT_EN[0],  /* Secure boot enable */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE[] =
{
  &SECURE_BOOT_AGGRESSIVE_REVOKE[0],  /* Enable aggressive secure boot revoke */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FLASH_TPUW[] =
{
  &FLASH_TPUW[0],  /* Flash wait time after power up. (unit is ms). When value is 15. the time is 30 ms */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_DOWNLOAD_MODE[] =
{
  &DIS_DOWNLOAD_MODE[0],  /* Disable download mode include boot_mode[3:0] is 0 1 2 3 6 7 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_LEGACY_SPI_BOOT[] =
{
  &DIS_LEGACY_SPI_BOOT[0],  /* Disable_Legcy_SPI_boot mode include boot_mode[3:0] is 4 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_UART_PRINT_CHANNEL[] =
{
  &UART_PRINT_CHANNEL[0],  /* 0: UART0. 1: UART1 */
  NULL
};

const efuse_desc_t *ESP_EFUSE_DIS_USB_DOWNLOAD_MODE[] =
{
  &DIS_USB_DOWNLOAD_MODE[0],  /* Disable download through USB */
  NULL
};

const efuse_desc_t *ESP_EFUSE_ENABLE_SECURITY_DOWNLOAD[] =
{
  &ENABLE_SECURITY_DOWNLOAD[0],  /* Enable security download mode */
  NULL
};

const efuse_desc_t *ESP_EFUSE_UART_PRINT_CONTROL[] =
{
  &UART_PRINT_CONTROL[0],  /* b00:force print. b01:control by GPIO46 - low level print. b10:control by GPIO46 - high level print. b11:force disable print. */
  NULL
};

const efuse_desc_t *ESP_EFUSE_PIN_POWER_SELECTION[] =
{
  &PIN_POWER_SELECTION[0],  /* GPIO33-GPIO37 power supply selection in ROM code. 0:VDD3P3_CPU. 1:VDD_SPI. */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FLASH_TYPE[] =
{
  &FLASH_TYPE[0],  /* Connected Flash interface type. 0: 4 data line. 1: 8 data line */
  NULL
};

const efuse_desc_t *ESP_EFUSE_FORCE_SEND_RESUME[] =
{
  &FORCE_SEND_RESUME[0],  /* Force ROM code to send a resume command during SPI boot */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SECURE_VERSION[] =
{
  &SECURE_VERSION[0],  /* Secure version for anti-rollback */
  NULL
};

const efuse_desc_t *ESP_EFUSE_MAC_FACTORY[] =
{
  &MAC_FACTORY[0],  /* Factory MAC addr [0] */
  &MAC_FACTORY[1],  /* Factory MAC addr [1] */
  &MAC_FACTORY[2],  /* Factory MAC addr [2] */
  &MAC_FACTORY[3],  /* Factory MAC addr [3] */
  &MAC_FACTORY[4],  /* Factory MAC addr [4] */
  &MAC_FACTORY[5],  /* Factory MAC addr [5] */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_CLK[] =
{
  &SPI_PAD_CONFIG_CLK[0],  /* SPI_PAD_configure CLK */
  NULL
};

const efuse_desc_t *ESP_EFUSE_SPI_PAD_CONFIG_Q_D1[] =
{
  &SPI_PAD_CONFIG_Q_D1[0],  /* SPI_PAD_configure Q(D1) */
  NULL
};

